{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 46], "input_dtype": "float32", "sparse": false, "name": "input_41"}, "inbound_nodes": [], "name": "input_41"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_201", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 46, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 35}, "inbound_nodes": [[["input_41", 0, 0]]], "name": "dense_201"}, {"class_name": "PReLU", "config": {"init": "zero", "trainable": true, "name": "prelu_161"}, "inbound_nodes": [[["dense_201", 0, 0]]], "name": "prelu_161"}, {"class_name": "Dropout", "config": {"p": 0.11, "trainable": true, "name": "dropout_121"}, "inbound_nodes": [[["prelu_161", 0, 0]]], "name": "dropout_121"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_202", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 35, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 20}, "inbound_nodes": [[["dropout_121", 0, 0]]], "name": "dense_202"}, {"class_name": "PReLU", "config": {"init": "zero", "trainable": true, "name": "prelu_162"}, "inbound_nodes": [[["dense_202", 0, 0]]], "name": "prelu_162"}, {"class_name": "Dropout", "config": {"p": 0.09, "trainable": true, "name": "dropout_122"}, "inbound_nodes": [[["prelu_162", 0, 0]]], "name": "dropout_122"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_203", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 20, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 10}, "inbound_nodes": [[["dropout_122", 0, 0]]], "name": "dense_203"}, {"class_name": "PReLU", "config": {"init": "zero", "trainable": true, "name": "prelu_163"}, "inbound_nodes": [[["dense_203", 0, 0]]], "name": "prelu_163"}, {"class_name": "Dropout", "config": {"p": 0.07, "trainable": true, "name": "dropout_123"}, "inbound_nodes": [[["prelu_163", 0, 0]]], "name": "dropout_123"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_204", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 10, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 7}, "inbound_nodes": [[["dropout_123", 0, 0]]], "name": "dense_204"}, {"class_name": "PReLU", "config": {"init": "zero", "trainable": true, "name": "prelu_164"}, "inbound_nodes": [[["dense_204", 0, 0]]], "name": "prelu_164"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_205", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 7, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 2}, "inbound_nodes": [[["prelu_164", 0, 0]]], "name": "dense_205"}], "input_layers": [["input_41", 0, 0]], "output_layers": [["dense_205", 0, 0]], "name": "model_41"}}