{"class_name": "Model", "keras_version": "2.0.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 46], "name": "input_9", "sparse": false}, "inbound_nodes": [], "name": "input_9"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_49", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 70, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["input_9", 0, 0, {}]]], "name": "dense_49"}, {"class_name": "PReLU", "config": {"name": "p_re_lu_41", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": null}, "inbound_nodes": [[["dense_49", 0, 0, {}]]], "name": "p_re_lu_41"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_50", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 35, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["p_re_lu_41", 0, 0, {}]]], "name": "dense_50"}, {"class_name": "PReLU", "config": {"name": "p_re_lu_42", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": null}, "inbound_nodes": [[["dense_50", 0, 0, {}]]], "name": "p_re_lu_42"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_51", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 20, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["p_re_lu_42", 0, 0, {}]]], "name": "dense_51"}, {"class_name": "PReLU", "config": {"name": "p_re_lu_43", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": null}, "inbound_nodes": [[["dense_51", 0, 0, {}]]], "name": "p_re_lu_43"}, {"class_name": "Dropout", "config": {"rate": 0.09, "trainable": true, "name": "dropout_17"}, "inbound_nodes": [[["p_re_lu_43", 0, 0, {}]]], "name": "dropout_17"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_52", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_17", 0, 0, {}]]], "name": "dense_52"}, {"class_name": "PReLU", "config": {"name": "p_re_lu_44", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": null}, "inbound_nodes": [[["dense_52", 0, 0, {}]]], "name": "p_re_lu_44"}, {"class_name": "Dropout", "config": {"rate": 0.07, "trainable": true, "name": "dropout_18"}, "inbound_nodes": [[["p_re_lu_44", 0, 0, {}]]], "name": "dropout_18"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_53", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 7, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_18", 0, 0, {}]]], "name": "dense_53"}, {"class_name": "PReLU", "config": {"name": "p_re_lu_45", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": null}, "inbound_nodes": [[["dense_53", 0, 0, {}]]], "name": "p_re_lu_45"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_54", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["p_re_lu_45", 0, 0, {}]]], "name": "dense_54"}], "input_layers": [["input_9", 0, 0]], "output_layers": [["dense_54", 0, 0]], "name": "model_9"}, "backend": "tensorflow"}