{"class_name": "Model", "keras_version": "2.0.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 46], "name": "input_86", "sparse": false}, "inbound_nodes": [], "name": "input_86"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_512", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 70, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["input_86", 0, 0, {}]]], "name": "dense_512"}, {"class_name": "PReLU", "config": {"name": "p_re_lu_426", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": null}, "inbound_nodes": [[["dense_512", 0, 0, {}]]], "name": "p_re_lu_426"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_513", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 35, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["p_re_lu_426", 0, 0, {}]]], "name": "dense_513"}, {"class_name": "PReLU", "config": {"name": "p_re_lu_427", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": null}, "inbound_nodes": [[["dense_513", 0, 0, {}]]], "name": "p_re_lu_427"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_514", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 20, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["p_re_lu_427", 0, 0, {}]]], "name": "dense_514"}, {"class_name": "PReLU", "config": {"name": "p_re_lu_428", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": null}, "inbound_nodes": [[["dense_514", 0, 0, {}]]], "name": "p_re_lu_428"}, {"class_name": "Dropout", "config": {"rate": 0.09, "trainable": true, "name": "dropout_316"}, "inbound_nodes": [[["p_re_lu_428", 0, 0, {}]]], "name": "dropout_316"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_515", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_316", 0, 0, {}]]], "name": "dense_515"}, {"class_name": "PReLU", "config": {"name": "p_re_lu_429", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": null}, "inbound_nodes": [[["dense_515", 0, 0, {}]]], "name": "p_re_lu_429"}, {"class_name": "Dropout", "config": {"rate": 0.07, "trainable": true, "name": "dropout_317"}, "inbound_nodes": [[["p_re_lu_429", 0, 0, {}]]], "name": "dropout_317"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_516", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 7, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_317", 0, 0, {}]]], "name": "dense_516"}, {"class_name": "PReLU", "config": {"name": "p_re_lu_430", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": null}, "inbound_nodes": [[["dense_516", 0, 0, {}]]], "name": "p_re_lu_430"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_517", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["p_re_lu_430", 0, 0, {}]]], "name": "dense_517"}], "input_layers": [["input_86", 0, 0]], "output_layers": [["dense_517", 0, 0]], "name": "model_86"}, "backend": "tensorflow"}