{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 46], "input_dtype": "float32", "sparse": false, "name": "input_12"}, "inbound_nodes": [], "name": "input_12"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_67", "activity_regularizer": null, "trainable": true, "W_learning_rate_multiplier": null, "b_regularizer": null, "init": "glorot_uniform", "input_dtype": "float32", "b_learning_rate_multiplier": null, "input_dim": 46, "batch_input_shape": [null, 46], "W_regularizer": null, "activation": "linear", "output_dim": 70}, "inbound_nodes": [[["input_12", 0, 0]]], "name": "dense_67"}, {"class_name": "PReLU", "config": {"init": "zero", "trainable": true, "name": "prelu_56"}, "inbound_nodes": [[["dense_67", 0, 0]]], "name": "prelu_56"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_68", "activity_regularizer": null, "trainable": true, "W_learning_rate_multiplier": null, "b_regularizer": null, "init": "glorot_uniform", "input_dtype": "float32", "b_learning_rate_multiplier": null, "input_dim": 70, "batch_input_shape": [null, 70], "W_regularizer": null, "activation": "linear", "output_dim": 35}, "inbound_nodes": [[["prelu_56", 0, 0]]], "name": "dense_68"}, {"class_name": "PReLU", "config": {"init": "zero", "trainable": true, "name": "prelu_57"}, "inbound_nodes": [[["dense_68", 0, 0]]], "name": "prelu_57"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_69", "activity_regularizer": null, "trainable": true, "W_learning_rate_multiplier": null, "b_regularizer": null, "init": "glorot_uniform", "input_dtype": "float32", "b_learning_rate_multiplier": null, "input_dim": 35, "batch_input_shape": [null, 35], "W_regularizer": null, "activation": "linear", "output_dim": 20}, "inbound_nodes": [[["prelu_57", 0, 0]]], "name": "dense_69"}, {"class_name": "PReLU", "config": {"init": "zero", "trainable": true, "name": "prelu_58"}, "inbound_nodes": [[["dense_69", 0, 0]]], "name": "prelu_58"}, {"class_name": "Dropout", "config": {"p": 0.09, "trainable": true, "name": "dropout_23"}, "inbound_nodes": [[["prelu_58", 0, 0]]], "name": "dropout_23"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_70", "activity_regularizer": null, "trainable": true, "W_learning_rate_multiplier": null, "b_regularizer": null, "init": "glorot_uniform", "input_dtype": "float32", "b_learning_rate_multiplier": null, "input_dim": 20, "batch_input_shape": [null, 20], "W_regularizer": null, "activation": "linear", "output_dim": 10}, "inbound_nodes": [[["dropout_23", 0, 0]]], "name": "dense_70"}, {"class_name": "PReLU", "config": {"init": "zero", "trainable": true, "name": "prelu_59"}, "inbound_nodes": [[["dense_70", 0, 0]]], "name": "prelu_59"}, {"class_name": "Dropout", "config": {"p": 0.07, "trainable": true, "name": "dropout_24"}, "inbound_nodes": [[["prelu_59", 0, 0]]], "name": "dropout_24"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_71", "activity_regularizer": null, "trainable": true, "W_learning_rate_multiplier": null, "b_regularizer": null, "init": "glorot_uniform", "input_dtype": "float32", "b_learning_rate_multiplier": null, "input_dim": 10, "batch_input_shape": [null, 10], "W_regularizer": null, "activation": "linear", "output_dim": 7}, "inbound_nodes": [[["dropout_24", 0, 0]]], "name": "dense_71"}, {"class_name": "PReLU", "config": {"init": "zero", "trainable": true, "name": "prelu_60"}, "inbound_nodes": [[["dense_71", 0, 0]]], "name": "prelu_60"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_72", "activity_regularizer": null, "trainable": true, "W_learning_rate_multiplier": null, "b_regularizer": null, "init": "glorot_uniform", "input_dtype": "float32", "b_learning_rate_multiplier": null, "input_dim": 7, "batch_input_shape": [null, 7], "W_regularizer": null, "activation": "softmax", "output_dim": 2}, "inbound_nodes": [[["prelu_60", 0, 0]]], "name": "dense_72"}], "input_layers": [["input_12", 0, 0]], "output_layers": [["dense_72", 0, 0]], "name": "model_12"}}